In [1]:
print("Hello World!")

Hello World!

In [2]:
# !pip install SQLAlchemy
# !pip install ipython-sql

In [3]:
# !pip install --upgrade pandas

In [4]:
import pandas as pd
import sqlite3,sqlalchemy
from typing import Optional,List
from sqlalchemy import ForeignKey,UniqueConstraint
from sqlalchemy import Integer, Float, DateTime,Boolean
from sqlalchemy import String
from sqlalchemy.orm import Mapped
from sqlalchemy.orm import mapped_column
from sqlalchemy.orm import DeclarativeBase
from sqlalchemy.orm import relationship

In [5]:
pd.__version__, sqlite3.sqlite_version,sqlalchemy.__version__

('2.0.3', '3.36.0', '2.0.29')

In [6]:
%load_ext sql

In [7]:

class Base(DeclarativeBase):
    pass

    
class TeamDTO(Base):
    __tablename__ = 'teams'
    # prim_id:Mapped[int] = mapped_column(primary_key=True)
    id: Mapped[Optional[int]] = mapped_column(primary_key=True)
    name: Mapped[Optional[str]]
    abbreviation: Mapped[Optional[str]]
    nickname: Mapped[Optional[str]]
    city: Mapped[Optional[str]]
    state: Mapped[Optional[str]]
    year_founded: Mapped[Optional[int]]

class PlayerDTO(Base):
    __tablename__ = 'players'
    # prim_id:Mapped[int] = mapped_column(Integer, primary_key=True)
    id: Mapped[Optional[int]] = mapped_column(primary_key=True)
    full_name: Mapped[Optional[str]]
    first_name: Mapped[Optional[str]]
    last_name: Mapped[Optional[str]]
    is_active: Mapped[Optional[bool]]

    
class PlayerCareerStatsDTO(Base):
    __tablename__ = 'player_career_stats'
    # prim_id:Mapped[int] = mapped_column(Integer, primary_key=True)
    id:Mapped[int] = mapped_column(Integer, primary_key=True)
    teamid:Mapped[int] = mapped_column(Integer, primary_key=True)
    team: Mapped[Optional[str]]
    season: Mapped[str] = mapped_column(String, primary_key=True)
    age: Mapped[Optional[float]]
    pts: Mapped[Optional[int]]

In [8]:
from sqlalchemy import create_engine
engine = create_engine("sqlite:///nbabasketballdb.sqlite3", echo=True)

In [9]:
Base.metadata.create_all(engine)

2024-03-25 08:09:36,505 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-03-25 08:09:36,505 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("teams")
2024-03-25 08:09:36,505 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,505 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("teams")
2024-03-25 08:09:36,505 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,513 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("players")
2024-03-25 08:09:36,513 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,513 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("players")
2024-03-25 08:09:36,513 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,513 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("player_career_stats")
2024-03-25 08:09:36,513 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,522 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("player_career_stats")
2024-03-25 08:09:36,522 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,522 INFO sqlalchemy.engine.Engine
CREATE TABLE teams (
	id INTEGER,
	name VARCHAR,
	abbreviation VARCHAR,
	nickname VARCHAR,
	city VARCHAR,
	state VARCHAR,
	year_founded INTEGER,
	PRIMARY KEY (id)
)


2024-03-25 08:09:36,522 INFO sqlalchemy.engine.Engine [no key 0.00105s] ()
2024-03-25 08:09:36,539 INFO sqlalchemy.engine.Engine
CREATE TABLE players (
	id INTEGER,
	full_name VARCHAR,
	first_name VARCHAR,
	last_name VARCHAR,
	is_active BOOLEAN,
	PRIMARY KEY (id)
)


2024-03-25 08:09:36,539 INFO sqlalchemy.engine.Engine [no key 0.00159s] ()
2024-03-25 08:09:36,547 INFO sqlalchemy.engine.Engine
CREATE TABLE player_career_stats (
	id INTEGER NOT NULL,
	teamid INTEGER NOT NULL,
	team VARCHAR,
	season VARCHAR NOT NULL,
	age FLOAT,
	pts INTEGER,
	PRIMARY KEY (id, teamid, season)
)


2024-03-25 08:09:36,547 INFO sqlalchemy.engine.Engine [no key 0.00086s] ()
2024-03-25 08:09:36,565 INFO sqlalchemy.engine.Engine COMMIT

In [10]:

%sql sqlite:///nbabasketballdb.sqlite3

In [11]:
%%sql
select * from player_career_stats limit 10

 * sqlite:///nbabasketballdb.sqlite3
Done.

[]

In [12]:
%%sql
select * from teams

 * sqlite:///nbabasketballdb.sqlite3
Done.

[]

In [13]:
%%sql
select * from players limit 10

 * sqlite:///nbabasketballdb.sqlite3
Done.

[]

In [14]:
# teamsdf = pd.read_csv('nbateams.csv')
# teamsdf.to_sql('teams', engine,if_exists='append',index=False)

# playersdf = pd.read_csv('nbaplayers.csv')
# playersdf.to_sql('players', engine,if_exists='append',index=False)

# playercareerdf = pd.read_csv('nbaplayerstats.csv')
# playercareerdf.to_sql('player_career_stats', engine,if_exists='append',index=False)

2024-03-25 08:09:36,714 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-03-25 08:09:36,721 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("teams")
2024-03-25 08:09:36,722 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,722 INFO sqlalchemy.engine.Engine INSERT INTO teams (id, name, abbreviation, nickname, city, state, year_founded) VALUES (?, ?, ?, ?, ?, ?, ?)
2024-03-25 08:09:36,730 INFO sqlalchemy.engine.Engine [generated in 0.00381s] [(1610612737, 'Atlanta Hawks', 'ATL', 'Hawks', 'Atlanta', 'Georgia', 1949), (1610612738, 'Boston Celtics', 'BOS', 'Celtics', 'Boston', 'Massachusetts', 1946), (1610612739, 'Cleveland Cavaliers', 'CLE', 'Cavaliers', 'Cleveland', 'Ohio', 1970), (1610612740, 'New Orleans Pelicans', 'NOP', 'Pelicans', 'New Orleans', 'Louisiana', 2002), (1610612741, 'Chicago Bulls', 'CHI', 'Bulls', 'Chicago', 'Illinois', 1966), (1610612742, 'Dallas Mavericks', 'DAL', 'Mavericks', 'Dallas', 'Texas', 1980), (1610612743, 'Denver Nuggets', 'DEN', 'Nuggets', 'Denver', 'Colorado', 1976), (1610612744, 'Golden State Warriors', 'GSW', 'Warriors', 'Golden State', 'California', 1946)  ... displaying 10 of 30 total bound parameter sets ...  (1610612765, 'Detroit Pistons', 'DET', 'Pistons', 'Detroit', 'Michigan', 1948), (1610612766, 'Charlotte Hornets', 'CHA', 'Hornets', 'Charlotte', 'North Carolina', 1988)]
2024-03-25 08:09:36,730 INFO sqlalchemy.engine.Engine COMMIT
2024-03-25 08:09:36,755 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-03-25 08:09:36,763 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("players")
2024-03-25 08:09:36,763 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,831 INFO sqlalchemy.engine.Engine INSERT INTO players (id, full_name, first_name, last_name, is_active) VALUES (?, ?, ?, ?, ?)
2024-03-25 08:09:36,833 INFO sqlalchemy.engine.Engine [generated in 0.05091s] [(76001, 'Alaa Abdelnaby', 'Alaa', 'Abdelnaby', 0), (76002, 'Zaid Abdul-Aziz', 'Zaid', 'Abdul-Aziz', 0), (76003, 'Kareem Abdul-Jabbar', 'Kareem', 'Abdul-Jabbar', 0), (51, 'Mahmoud Abdul-Rauf', 'Mahmoud', 'Abdul-Rauf', 0), (1505, 'Tariq Abdul-Wahad', 'Tariq', 'Abdul-Wahad', 0), (949, 'Shareef Abdur-Rahim', 'Shareef', 'Abdur-Rahim', 0), (76005, 'Tom Abernethy', 'Tom', 'Abernethy', 0), (76006, 'Forest Able', 'Forest', 'Able', 0)  ... displaying 10 of 4900 total bound parameter sets ...  (1627826, 'Ivica Zubac', 'Ivica', 'Zubac', 1), (78650, 'Matt Zunic', 'Matt', 'Zunic', 0)]
2024-03-25 08:09:36,860 INFO sqlalchemy.engine.Engine COMMIT
2024-03-25 08:09:36,876 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-03-25 08:09:36,879 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("player_career_stats")
2024-03-25 08:09:36,880 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 08:09:36,884 INFO sqlalchemy.engine.Engine INSERT INTO player_career_stats (id, teamid, team, season, age, pts) VALUES (?, ?, ?, ?, ?, ?)
2024-03-25 08:09:36,884 INFO sqlalchemy.engine.Engine [generated in 0.00111s] [(2544, 1610612739, 'CLE', '2003-04', 19.0, 1654), (2544, 1610612739, 'CLE', '2004-05', 20.0, 2175), (2544, 1610612739, 'CLE', '2005-06', 21.0, 2478), (2544, 1610612739, 'CLE', '2006-07', 22.0, 2132), (2544, 1610612739, 'CLE', '2007-08', 23.0, 2250), (2544, 1610612739, 'CLE', '2008-09', 24.0, 2304), (2544, 1610612739, 'CLE', '2009-10', 25.0, 2258), (2544, 1610612748, 'MIA', '2010-11', 26.0, 2111)  ... displaying 10 of 62 total bound parameter sets ...  (1628973, 1610612752, 'NYK', '2022-23', 26.0, 1633), (1628973, 1610612752, 'NYK', '2023-24', 27.0, 1780)]
2024-03-25 08:09:36,888 INFO sqlalchemy.engine.Engine COMMIT

62

       id        full_name first_name last_name  is_active
0  999001  Pranav Munigala     Pranav  Munigala       True

In [42]:
# %sql select count(*) from player_career_stats
# %sql select count(*) from teams
# %sql select count(*) from players
# %sql select * from players where full_name = 'LeBron James'
# %sql select * from teams where abbreviation = 'LAL'
# %sql select * from player_career_stats where id = 2544
# %sql select * from player_career_stats where id in (select id from players where full_name = 'LeBron James')
# %sql select count(*),team,id from player_career_stats group by id ,team
# %sql select * from player_career_stats where team='LAL'
%sql select sum(pts) totpts,count(*) totseasons,id,team,sum(pts)/count(*) avgpoints_per_season from player_career_stats group by id ,team

 * sqlite:///nbabasketballdb.sqlite3
Done.

[(29277, 13, 893, 'CHI', 2252),
 (3015, 2, 893, 'WAS', 1507),
 (33643, 20, 977, 'LAL', 1682),
 (23119, 11, 2544, 'CLE', 2101),
 (9187, 6, 2544, 'LAL', 1531),
 (7919, 4, 2544, 'MIA', 1979),
 (3286, 4, 1628973, 'DAL', 821),
 (3413, 2, 1628973, 'NYK', 1706)]

In [55]:
mhteam = pd.DataFrame([[999999999,'Morris Hills High School','MHI','Knights','Randolph','NJ',1989]],columns=['id', 'name', 'abbreviation', 'nickname', 'city', 'state', 'year_founded'])
mhplayers = pd.DataFrame([
        [999001,'Pranav Munigala','Pranav','Munigala',True],
        [999002,'Eeshan Bhansali','Eeshan','Bhansali',True],
        [999003,'Siddhant Bhansali','Siddhant','Bhansali',True],
        [999004,'Raj Shah','Raj','Shah',True]

    ],
    columns=['id','full_name','first_name','last_name','is_active'])

In [56]:
# mhteam.to_sql('teams', engine,if_exists='append',index=False)
# mhplayers.to_sql('players', engine,if_exists='append',index=False)

2024-03-25 11:22:07,189 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-03-25 11:22:07,191 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("players")
2024-03-25 11:22:07,193 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 11:22:07,196 INFO sqlalchemy.engine.Engine INSERT INTO players (id, full_name, first_name, last_name, is_active) VALUES (?, ?, ?, ?, ?)
2024-03-25 11:22:07,196 INFO sqlalchemy.engine.Engine [generated in 0.00140s] [(999002, 'Eeshan Bhansali', 'Eeshan', 'Bhansali', 1), (999003, 'Siddhant Bhansali', 'Siddhant', 'Bhansali', 1), (999004, 'Raj Shah', 'Raj', 'Shah', 1)]
2024-03-25 11:22:07,201 INFO sqlalchemy.engine.Engine COMMIT

3

In [62]:
%sql select * from players where id >= 999001 limit 4
# %sql select * from teams where id = 999999999

 * sqlite:///nbabasketballdb.sqlite3
Done.

[(999001, 'Pranav Munigala', 'Pranav', 'Munigala', 1),
 (999002, 'Eeshan Bhansali', 'Eeshan', 'Bhansali', 1),
 (999003, 'Siddhant Bhansali', 'Siddhant', 'Bhansali', 1),
 (999004, 'Raj Shah', 'Raj', 'Shah', 1)]